{
  "start_page": 1,
  "pages": [
    {
      "id": 1,
      "text": "Sei un valoroso guerriero nel regno di Eldoria. Hai dimostrato la tua abilità in molte battaglie e ora ti è stata assegnata una missione cruciale. La principessa Elysia è stata rapita dal malvagio stregone Morlog. Devi salvarla e riportarla sana e salva al regno di Arathor. Ti trovi ora all'ingresso della pericolosa Caverna dell'Oscurità, dove si dice che Morlog abbia stabilito la sua dimora. Sei pronto ad affrontare questa sfida?",
      "options": [
        {
          "text": "Avventurati nella Caverna dell'Oscurità",
          "destination": 2
        },
        {
          "text": "Attacca il manichino",
          "destination": 3,
          "combat": {
            "name": "Manichino",
            "health": 10,
            "attacks": [
              {
                "name": "Colpo",
                "damage": 5
              },
              {
                "name": "Schiaffo",
                "damage": 3
              }
            ],
            "victory_text": "Il manichino finisce a pezzi davanti a te.",
            "defeat_text": "Il manichino prende vita e ti sconfigge. Sei stato sconfitto.",
            "loot": "Pozione curativa"
          }
        }
      ]
    },
    {
      "id": 2,
      "text": "Prosegui con cautela nella caverna, notando come l'oscurità sembra avvolgerti completamente. L'umidità dell'aria e il rumore delle gocce d'acqua che cadono dall'alto ti ricordano la pericolosità di questa missione. Ad un tratto, senti un fruscio alle tue spalle...",
      "options": [
        {
          "text": "Estrai la spada e ti prepari a combattere",
          "destination": 4,
          "combat": {
            "name": "Serpente delle ombre",
            "health": 15,
            "attacks": [
              {
                "name": "Morso velenoso",
                "damage": 7
              },
              {
                "name": "Colpo di coda",
                "damage": 5
              }
            ],
            "victory_text": "Dopo una lotta intensa, riesci a sconfiggere il Serpente delle ombre.",
            "defeat_text": "Il Serpente delle ombre ti colpisce con un morso letale. Sei stato sconfitto.",
            "loot": "Pozione di antiveleno"
          }
        },
        {
          "text": "Cerca di scappare",
          "destination": 5
        }
      ]
    },
    {
      "id": 3,
      "text": "Ti avvicini al manichino per allenarti. Noti che è stato realizzato con cura per simulare un avversario vero. Pronto per l'allenamento, ti prepari a combattere.",
      "options": [
        {
          "text": "Ritorna all'ingresso della caverna",
          "destination": 1
        }
      ]
    }
  ]
}
